InformationRegisters/СостоянияОригиналовПервичныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СостоянияОригиналовПервичныхДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияОригиналовПервичныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Владелец</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектСУчетомОригиналовПервичныхДокументов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПервичныйДокумент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сотрудник</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/гф_ИсторияСостоянийОригиналовПервичныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>гф_ИсторияСостоянийОригиналовПервичныхДокументов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияОригиналовПервичныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сотрудник</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПервичныйДокументПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Владелец</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектСУчетомОригиналовПервичныхДокументов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПервичныйДокумент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостоянияОригиналовПервичныхДокументов/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий


// #wortmann {
// #
// Галфинд Окунев 2022/08/15
// Записывает историю изменения состояний
//
// Параметры:
//
// Отказ		- Булево
// Замещение	- Булево
//
&После("ПередЗаписью")
Процедура гф_ПередЗаписью(Отказ, Замещение)   
	
	ТаблицаИзменений	= ЭтотОбъект.Выгрузить(,"Владелец, ПервичныйДокумент, " +  
										"ПервичныйДокументПредставление, Состояние, Сотрудник");
	МоментВремени		= ТекущаяДатаСеанса();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВТ_Состояния.Владелец КАК Владелец,
	               |	ВТ_Состояния.ПервичныйДокумент КАК ПервичныйДокумент,
	               |	ВТ_Состояния.Состояние КАК Состояние,
	               |	ВТ_Состояния.Сотрудник КАК Сотрудник,
	               |	ВТ_Состояния.ПервичныйДокументПредставление КАК ПервичныйДокументПредставление
	               |ПОМЕСТИТЬ ВТ_Состояния
	               |ИЗ
	               |	&ТаблицаИзменений КАК ВТ_Состояния
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	гф_ИсторияСостоянийОригиналовПервичныхДокументовСрезПоследних.Владелец КАК Владелец,
	               |	гф_ИсторияСостоянийОригиналовПервичныхДокументовСрезПоследних.Состояние КАК Состояние,
	               |	гф_ИсторияСостоянийОригиналовПервичныхДокументовСрезПоследних.ПервичныйДокумент КАК ПервичныйДокумент
	               |ПОМЕСТИТЬ ВТ_История
	               |ИЗ
	               |	РегистрСведений.гф_ИсторияСостоянийОригиналовПервичныхДокументов.СрезПоследних(
	               |			&МоментВремени,
	               |			Владелец В
	               |				(ВЫБРАТЬ
	               |					Т.Владелец
	               |				ИЗ
	               |					ВТ_Состояния КАК Т)) КАК гф_ИсторияСостоянийОригиналовПервичныхДокументовСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Состояния.Владелец КАК Владелец,
	               |	ВТ_Состояния.Состояние КАК Состояние,
	               |	ВТ_Состояния.ПервичныйДокумент КАК ПервичныйДокумент,
	               |	ВТ_Состояния.Сотрудник КАК Сотрудник,
	               |	&МоментВремени КАК Период,
	               |	ВТ_Состояния.ПервичныйДокументПредставление КАК ПервичныйДокументПредставление
	               |ИЗ
	               |	ВТ_Состояния КАК ВТ_Состояния
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_История КАК ВТ_История
	               |		ПО ВТ_Состояния.Владелец = ВТ_История.Владелец
	               |			И ВТ_Состояния.Состояние = ВТ_История.Состояние
	               |			И ВТ_Состояния.ПервичныйДокумент = ВТ_История.ПервичныйДокумент
	               |ГДЕ
	               |	ВТ_История.Владелец ЕСТЬ NULL
	               |	И ВТ_Состояния.ПервичныйДокумент <> """"";
	
	Запрос.Параметры.Вставить("ТаблицаИзменений", ТаблицаИзменений);
	Запрос.Параметры.Вставить("МоментВремени", МоментВремени);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Запись = РегистрыСведений.гф_ИсторияСостоянийОригиналовПервичныхДокументов.СоздатьМенеджерЗаписи();
			
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			
			Запись.Активность	= Истина;   
			
			Запись.Записать(Истина);
			
		КонецЦикла;	
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
